use proconio::input;
use std::cmp;

fn main() {
    input! {
        n: usize,
        a: [i64;n],
    }

    let mut dp1 = vec![0i64; n + 1];
    let mut dp2 = vec![0i64; n + 1];

    for i in 1..=n {
        dp1[i] = dp2[i - 1] + a[i - 1];
        dp2[i] = cmp::max(dp1[i - 1], dp2[i - 1]);
    }
    println!("{}", cmp::max(dp1[n], dp2[n]));
}

// 5
// 2 5 3 3 1
//
// 1 日目
// 勉強する   dp1: [0, 2, 0, 0, 0, 0]
// 勉強しない dp2: [0, 0, 0, 0, 0, 0]
//
// 2 日目
// 勉強する   dp1: [0, 2, 5, 0, 0, 0]
// 勉強しない dp2: [0, 0, 2, 0, 0, 0]
//
// 3 日目
// 勉強する   dp1: [0, 2, 5, 5, 0, 0]
// 勉強しない dp2: [0, 0, 2, 5, 0, 0]
//
// 4 日目
// 勉強する   dp1: [0, 2, 5, 5, 8, 0]
// 勉強しない dp2: [0, 0, 2, 5, 5, 0]
//
// 5 日目
// 勉強する   dp1: [0, 2, 5, 5, 8, 6]
// 勉強しない dp2: [0, 0, 2, 5, 5, 8]
//
// 結果: 8
